{
  "general": {
    "appName": {
      "text": "osu!sunrise",
      "context": "The name of the application, will be inclided in various places such as the title meta tag"
    },
    "serverTitle": {
      "full": {
        "text": "sunrise",
        "context": "The full name of the server"
      },
      "split": {
        "part1": {
          "text": "sun",
          "context": "The first part of the split server name"
        },
        "part2": {
          "text": "rise",
          "context": "The second part of the split server name"
        }
      }
    }
  },
  "components": {
    "serverMaintenanceDialog": {
      "message": {
        "text": "The server is currently in <b>maintenance mode</b>, so some features of the website <b>may not function correctly</b>.",
        "context": "This message is shown to users when the server is under maintenance."
      }
    }
  },
  "pages": {
    "mainPage": {
      "meta": {
        "title": {
          "text": "Welcome | {appName}",
          "context": "The title for the main page of the osu!sunrise website"
        },
        "description": {
          "text": "Join osu!sunrise, a feature-rich private osu! server with Relax, Autopilot, ScoreV2 support, and a custom PP system tailored for Relax and Autopilot gameplay.",
          "context": "The meta description for the main page of the osu!sunrise website"
        }
      },
      "features": {
        "motto": {
          "text": "- yet another osu! server",
          "context": "The tagline or motto displayed on the main page"
        },
        "description": {
          "text": "Features rich osu! server with support for Relax, Autopilot and ScoreV2 gameplay, with a custom art‑state PP calculation system tailored for Relax and Autopilot.",
          "context": "The main description text explaining the server's features on the homepage"
        },
        "buttons": {
          "register": {
            "text": "Join now",
            "context": "Button text to register a new account"
          },
          "wiki": {
            "text": "How to connect",
            "context": "Button text linking to the connection guide"
          }
        }
      },
      "whyUs": {
        "text": "Why us?",
        "context": "Section heading asking why users should choose this server"
      },
      "cards": {
        "freeFeatures": {
          "title": {
            "text": "Truly Free Features",
            "context": "Title of the free features card on the main page"
          },
          "description": {
            "text": "Enjoy features like osu!direct and username changes without any paywalls — completely free for all players!",
            "context": "Description text explaining the free features available on the server"
          }
        },
        "ppSystem": {
          "title": {
            "text": "Custom PP Calculations",
            "context": "Title of the PP system card on the main page"
          },
          "description": {
            "text": "We use the latest performance point (PP) system for vanilla scores while applying a custom, well-balanced formula for Relax and Autopilot modes.",
            "context": "Description text explaining the custom PP calculation system"
          }
        },
        "medals": {
          "title": {
            "text": "Earn Custom Medals",
            "context": "Title of the medals card on the main page"
          },
          "description": {
            "text": "Earn unique, server-exclusive medals as you accomplish various milestones and achievements.",
            "context": "Description text explaining the custom medals system"
          }
        },
        "updates": {
          "title": {
            "text": "Frequent Updates",
            "context": "Title of the updates card on the main page"
          },
          "description": {
            "text": "We're always improving! Expect regular updates, new features, and ongoing performance optimizations.",
            "context": "Description text explaining the server's update frequency"
          }
        },
        "ppCalc": {
          "title": {
            "text": "Built-in PP Calculator",
            "context": "Title of the PP calculator card on the main page"
          },
          "description": {
            "text": "Our website offers a built-in PP calculator for quick and easy performance point estimates.",
            "context": "Description text explaining the built-in PP calculator feature"
          }
        },
        "sunriseCore": {
          "title": {
            "text": "Custom-Built Bancho Core",
            "context": "Title of the bancho core card on the main page"
          },
          "description": {
            "text": "Unlike most private osu! servers, we've developed our own custom bancho core for better stability and unique feature support.",
            "context": "Description text explaining the custom bancho core development"
          }
        }
      },
      "howToStart": {
        "title": {
          "text": "How do I start playing?",
          "context": "Section heading for the getting started guide"
        },
        "description": {
          "text": "Just three simple steps and you're ready to go!",
          "context": "Description text introducing the getting started steps"
        },
        "downloadTile": {
          "title": {
            "text": "Download osu! clinet",
            "context": "Title of the download step tile"
          },
          "description": {
            "text": "If you do not already have an installed client",
            "context": "Description text for the download step"
          },
          "button": {
            "text": "Download",
            "context": "Button text to download the osu! client"
          }
        },
        "registerTile": {
          "title": {
            "text": "Register osu!sunrise account",
            "context": "Title of the registration step tile"
          },
          "description": {
            "text": "Account will allow you to join the osu!sunrise community",
            "context": "Description text for the registration step"
          },
          "button": {
            "text": "Sign up",
            "context": "Button text to register a new account"
          }
        },
        "guideTile": {
          "title": {
            "text": "Follow the connection guide",
            "context": "Title of the connection guide step tile"
          },
          "description": {
            "text": "Which helps you set up your osu! client to connect to osu!sunrise",
            "context": "Description text for the connection guide step"
          },
          "button": {
            "text": "Open guide",
            "context": "Button text to open the connection guide"
          }
        }
      },
      "statuses": {
        "totalUsers": {
          "text": "Total Users",
          "context": "Label for the total number of registered users"
        },
        "usersOnline": {
          "text": "Users Online",
          "context": "Label for the number of currently online users"
        },
        "usersRestricted": {
          "text": "Users Restricted",
          "context": "Label for the number of restricted users"
        },
        "totalScores": {
          "text": "Total Scores",
          "context": "Label for the total number of scores submitted"
        },
        "serverStatus": {
          "text": "Server Status",
          "context": "Label for the current server status"
        },
        "online": {
          "text": "Online",
          "context": "Status indicator when the server is online"
        },
        "offline": {
          "text": "Offline",
          "context": "Status indicator when the server is offline"
        },
        "underMaintenance": {
          "text": "Under Maintenance",
          "context": "Status indicator when the server is under maintenance"
        }
      }
    },
    "wiki": {
      "meta": {
        "title": {
          "text": "Wiki | {appName}",
          "context": "The title for the wiki page of the osu!sunrise website"
        }
      },
      "header": {
        "text": "Wiki",
        "context": "The main header text for the wiki page"
      },
      "articles": {
        "howToConnect": {
          "title": {
            "text": "How to connect",
            "context": "Title of the wiki article explaining how to connect to the server"
          },
          "intro": {
            "text": "To connect to the server, you need to have a copy of the game installed on your computer. You can download the game from the official osu! website.",
            "context": "Introduction text explaining the prerequisites for connecting to the server"
          },
          "step1": {
            "text": "Locate the <code>osu!.exe</code> file in the game directory.",
            "context": "First step instruction for connecting to the server"
          },
          "step2": {
            "text": "Create a shortcut of the file.",
            "context": "Second step instruction for connecting to the server"
          },
          "step3": {
            "text": "Right click on the shortcut and select properties.",
            "context": "Third step instruction for connecting to the server"
          },
          "step4": {
            "text": "In the target field, add <code>-devserver {serverDomain}</code> at the end of the path.",
            "context": "Fourth step instruction for connecting to the server, includes server domain parameter"
          },
          "step5": {
            "text": "Click apply and then OK.",
            "context": "Fifth step instruction for connecting to the server"
          },
          "step6": {
            "text": "Double click on the shortcut to start the game.",
            "context": "Sixth step instruction for connecting to the server"
          },
          "imageAlt": {
            "text": "osu connect image",
            "context": "Alt text for the connection guide image"
          }
        },
        "multipleAccounts": {
          "title": {
            "text": "Can I have multiple accounts?",
            "context": "Title of the wiki article about multiple accounts policy"
          },
          "answer": {
            "text": "No. You are only allowed to have one account per person.",
            "context": "Direct answer to the multiple accounts question"
          },
          "consequence": {
            "text": "If you are caught with multiple accounts, you will be banned from the server.",
            "context": "Explanation of the consequence for having multiple accounts"
          }
        },
        "cheatsHacks": {
          "title": {
            "text": "Can I use cheats or hacks?",
            "context": "Title of the wiki article about cheating policy"
          },
          "answer": {
            "text": "No. You will be banned if you are caught.",
            "context": "Direct answer to the cheating question"
          },
          "policy": {
            "text": "We are very strict on cheating and do not tolerate it at all.<br></br>If you suspect someone of cheating, please report them to the staff.",
            "context": "Explanation of the cheating policy and how to report cheaters"
          }
        },
        "appealRestriction": {
          "title": {
            "text": "I think I was restricted unfairly. How can I appeal?",
            "context": "Title of the wiki article about appealing restrictions"
          },
          "instructions": {
            "text": "If you believe you were restricted unfairly, you can appeal your restriction by contacting the staff with your case.",
            "context": "Instructions on how to appeal a restriction"
          },
          "contactStaff": {
            "text": "You can contact the staff <a>here</a>.",
            "context": "Information about where to contact staff for appeals, includes link placeholder"
          }
        },
        "contributeSuggest": {
          "title": {
            "text": "Can I contribute/suggest changes to the server?",
            "context": "Title of the wiki article about contributing to the server"
          },
          "answer": {
            "text": "Yes! We are always open to suggestions.",
            "context": "Positive answer about contributing to the server"
          },
          "instructions": {
            "text": "If you have any suggestions, please submit them at our <a>GitHub</a> page.<br></br>Longterm contributors can also have chance to get permanent supporter tag.",
            "context": "Instructions on how to contribute, includes GitHub link and information about supporter tags"
          }
        },
        "multiplayerDownload": {
          "title": {
            "text": "I can't download maps when I'm in multiplayer, but I can download them from the main menu",
            "context": "Title of the wiki article about downloading maps in multiplayer"
          },
          "solution": {
            "text": "Disable <code>Automatically start osu!direct downloads</code> from the options and try again.",
            "context": "Solution to the multiplayer download issue"
          }
        }
      }
    },
    "rules": {
      "meta": {
        "title": {
          "text": "Rules | {appName}",
          "context": "The title for the rules page of the osu!sunrise website"
        }
      },
      "header": {
        "text": "Rules",
        "context": "The main header text for the rules page"
      },
      "sections": {
        "generalRules": {
          "title": {
            "text": "General rules",
            "context": "Title of the general rules section"
          },
          "noCheating": {
            "title": {
              "text": "<b>No Cheating or Hacking.</b>",
              "context": "Title of the no cheating rule, displayed in bold"
            },
            "description": {
              "text": "Any form of cheating, including aimbots, relax hacks, macros, or modified clients that give unfair advantage is strictly prohibited. Play fair, improve fair.",
              "context": "Description of the no cheating rule"
            },
            "warning": {
              "text": "As you can see, I wrote this in a bigger font for all you \"wannabe\" cheaters who think you can migrate from another private server to here after being banned. You will be found and executed (in Minecraft) if you cheat. So please, don't.",
              "context": "Warning message for potential cheaters"
            }
          },
          "noMultiAccount": {
            "title": {
              "text": "<b>No Multi-Accounting or Account Sharing.</b>",
              "context": "Title of the no multi-accounting rule, displayed in bold"
            },
            "description": {
              "text": "Only one account per player is allowed. If your primary account was restricted without an explanation, please contact support.",
              "context": "Description of the no multi-accounting rule"
            }
          },
          "noImpersonation": {
            "title": {
              "text": "<b>No Impersonating Popular Players or Staff</b>",
              "context": "Title of the no impersonation rule, displayed in bold"
            },
            "description": {
              "text": "Do not pretend to be a staff member or any well-known player. Misleading others can result in a username change or permanent ban.",
              "context": "Description of the no impersonation rule"
            }
          }
        },
        "chatCommunityRules": {
          "title": {
            "text": "Chat & Community Rules",
            "context": "Title of the chat and community rules section"
          },
          "beRespectful": {
            "title": {
              "text": "<b>Be Respectful.</b>",
              "context": "Title of the be respectful rule, displayed in bold"
            },
            "description": {
              "text": "Treat others with kindness. Harassment, hate speech, discrimination, or toxic behaviour won't be tolerated.",
              "context": "Description of the be respectful rule"
            }
          },
          "noNSFW": {
            "title": {
              "text": "<b>No NSFW or Inappropriate Content</b>",
              "context": "Title of the no NSFW content rule, displayed in bold"
            },
            "description": {
              "text": "Keep the server appropriate for all audiences — this applies to all user content, including but not limited to usernames, banners, avatars and profile descriptions.",
              "context": "Description of the no NSFW content rule"
            }
          },
          "noAdvertising": {
            "title": {
              "text": "<b>Advertising is forbidden.</b>",
              "context": "Title of the no advertising rule, displayed in bold"
            },
            "description": {
              "text": "Don't promote other servers, websites, or products without admin approval.",
              "context": "Description of the no advertising rule"
            }
          }
        },
        "disclaimer": {
          "title": {
            "text": "Important Disclaimer",
            "context": "Title of the important disclaimer section"
          },
          "intro": {
            "text": "By creating and/or maintaining an account on our platform, you acknowledge and agree to the following terms:",
            "context": "Introduction text for the disclaimer section"
          },
          "noLiability": {
            "title": {
              "text": "<b>No Liability.</b>",
              "context": "Title of the no liability disclaimer, displayed in bold"
            },
            "description": {
              "text": "You accept full responsibility for your participation in any services provided by Sunrise and acknowledge that you cannot hold the organization accountable for any consequences that may arise from your usage.",
              "context": "Description of the no liability disclaimer"
            }
          },
          "accountRestrictions": {
            "title": {
              "text": "<b>Account Restrictions.</b>",
              "context": "Title of the account restrictions disclaimer, displayed in bold"
            },
            "description": {
              "text": "The administration reserves the right to restrict or suspend any account, with or without prior notice, for violations of server rules or at their discretion.",
              "context": "Description of the account restrictions disclaimer"
            }
          },
          "ruleChanges": {
            "title": {
              "text": "<b>Rule Changes.</b>",
              "context": "Title of the rule changes disclaimer, displayed in bold"
            },
            "description": {
              "text": "The server rules are subject to change at any time. The administration may update, modify, or remove any rule with or without prior notification, and all players are expected to stay informed of any changes.",
              "context": "Description of the rule changes disclaimer"
            }
          },
          "agreementByParticipation": {
            "title": {
              "text": "<b>Agreement by Participation.</b>",
              "context": "Title of the agreement by participation disclaimer, displayed in bold"
            },
            "description": {
              "text": "By creating and/or maintaining an account on the server, you automatically agree to these terms and commit to adhering to the rules and guidelines in effect at the time.",
              "context": "Description of the agreement by participation disclaimer"
            }
          }
        }
      }
    }
  }
}
